
## Plan Result

[CI link](https://github.com/Masato-Nishioka/oidc-test/actions/runs/12161198618)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_storage_bucket.tfcmt-cicd-test


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_storage_bucket.tfcmt-cicd-test will be created
  + resource "google_storage_bucket" "tfcmt-cicd-test" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "tfcmt-cicd-test"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-ci","PRNumber":2,"Program":"tfcmt","SHA1":"a15569d4704a3842d6d19d2c83e96bd19bec38db","Vars":{},"WorkflowName":"Terraform-ci"} -->